NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKL82Z7.svd
        <register>
          <name>LTC0_PKA_6</name>
          <description>LTC PKHA A 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_7</name>
          <description>LTC PKHA A0 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_7</name>
          <description>LTC PKHA A 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x81C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_8</name>
          <description>LTC PKHA A0 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_8</name>
          <description>LTC PKHA A 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_9</name>
          <description>LTC PKHA A0 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_9</name>
          <description>LTC PKHA A 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_10</name>
          <description>LTC PKHA A0 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_10</name>
          <description>LTC PKHA A 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_11</name>
          <description>LTC PKHA A0 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_11</name>
          <description>LTC PKHA A 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x82C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_12</name>
          <description>LTC PKHA A0 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_12</name>
          <description>LTC PKHA A 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_13</name>
          <description>LTC PKHA A0 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_13</name>
          <description>LTC PKHA A 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_14</name>
          <description>LTC PKHA A0 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_14</name>
          <description>LTC PKHA A 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA0_15</name>
          <description>LTC PKHA A0 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A0</name>
              <description>A0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_15</name>
          <description>LTC PKHA A 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x83C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_0</name>
          <description>LTC PKHA A1 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_16</name>
          <description>LTC PKHA A 16 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_1</name>
          <description>LTC PKHA A1 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_17</name>
          <description>LTC PKHA A 17 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_2</name>
          <description>LTC PKHA A1 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_18</name>
          <description>LTC PKHA A 18 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_3</name>
          <description>LTC PKHA A1 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x84C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_19</name>
          <description>LTC PKHA A 19 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x84C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_4</name>
          <description>LTC PKHA A1 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_20</name>
          <description>LTC PKHA A 20 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_5</name>
          <description>LTC PKHA A1 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x854</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_21</name>
          <description>LTC PKHA A 21 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x854</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_6</name>
          <description>LTC PKHA A1 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_22</name>
          <description>LTC PKHA A 22 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_7</name>
          <description>LTC PKHA A1 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x85C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_23</name>
          <description>LTC PKHA A 23 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x85C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_8</name>
          <description>LTC PKHA A1 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_24</name>
          <description>LTC PKHA A 24 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_9</name>
          <description>LTC PKHA A1 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_25</name>
          <description>LTC PKHA A 25 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_10</name>
          <description>LTC PKHA A1 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_26</name>
          <description>LTC PKHA A 26 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_11</name>
          <description>LTC PKHA A1 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x86C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_27</name>
          <description>LTC PKHA A 27 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x86C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_12</name>
          <description>LTC PKHA A1 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKA_28</name>
          <description>LTC PKHA A 28 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x870</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKA1_13</name>
          <description>LTC PKHA A1 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_A1</name>
              <description>A1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
